# DrawForEachRun Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DrawForEachRun Property
ParameterTypeId Class See Also
---
"Draw for Each Run"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DrawForEachRun { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DrawForEachRun As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DrawForEachRun {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace